<template>
    <div class="board">
        <HomeCard
        v-for = "card in cards"
        :key="card.id"
        :icon="card.icon"
        :title="card.title"
        :text="card.text"
        ></HomeCard>
    </div>

</template>

<script>
import HomeCard from '@/components/HomeCard.vue';

export default{
    name:'HomeCardBoard',
    data(){
        return {
            cards:[
                {icon:"bi bi-pc-display", title:"Web разработка",
                 text:"Разработка BackEnd: Python, Django и FrontEnd: VuesJs, HTML5, CSS3. Этот набор является самым популярным (несмотря на то, что есть достоиные альтерантивы) и позволяет быстро и эффективно строить сложные и масштабные системы. Как и везде есть свои плюсы и минусы."},
               
                {icon:"bi bi-robot", title:"Автоматизация", 
                text:"Автоматизация - это ключевой процесс в мире информационных технологий, который позволяет ускорить и упростить рутинные задачи. В сфере разработки программного обеспечения, автоматизация может быть применена для создания парсеров, телеграм-ботов и скриптов для автоматизации рутинных бизнес-задач."},


                {icon:"bi bi-gear-fill", title:"CI/CD", 
                text:"Это сочетание непрерывной интеграции и непрерывного развертывания программного обеспечения во время разработки с помощью Docker. CI/CD объединяет разработку, тестирование и развертывание приложения. Это позволяет вносить любые изменения без остановки работы."},


                {icon:"bi bi-hdd-rack-fill", title:"Настройка сервера",
                text:"Настройка сервера - это важный этап в разработке веб-приложений, который включает в себя настройку операционной системы, установку необходимых сервисов, настройку безопасности, настройку сетевых параметров и т.д."},
            

                {icon:"bi bi-info-circle-fill", title:"Поддержка",
                text:"В работе очень важно и нужно уметь поддерживать контакт с коллективом, заказчиком и руководителем, находить общий язык и быть дружелюбным. Я очень общительный человек, который может помочь решить проблему и прийти к лучшему результату, даже если это очень сложно."},

                {icon:"bi bi-people-fill", title:"Консультация",
                text:"Этот процесс включает в себя понимание потребностей клиента, предоставление информации о продукте, решение вопросов, помощь в решении проблем и обеспечение должного уровня обслуживания."},

            
            ]
        }
    },
    components:{
        HomeCard
    }

}

</script>

<style scoped>
.board{
    display: flex;
    flex-wrap:wrap;
    justify-content: space-around;
    grid-gap:10px;
    margin:0 0 80px;
}

</style>